#Область ОбработчикиСобытий
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчетСуммыТовары();	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчетСуммыТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	РассчетСуммыТовары();
КонецПроцедуры

&НаКлиенте
Процедура РассчетСуммыТовары()
//	Элементы.Товары
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	ВсегоБезСкидки = СтрокаРасчета.Количество * СтрокаРасчета.Цена;
	СтрокаРасчета.Сумма = ВсегоБезСкидки - (ВсегоБезСкидки * СтрокаРасчета.ПроцентСкидки / 100);
КонецПроцедуры
#КонецОбласти