# Область ОбработчикиСобытий
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчета.Цена = ПолучитьАктуальнуюЦену(СтрокаРасчета.Услуга, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчета.Цена = ПолучитьАктуальнуюЦену(СтрокаРасчета.Товар, Объект.Дата);
	РассчетСуммыТовара();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчетСуммыТовара();
КонецПроцедуры
# КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьАктуальнуюЦену(Номенклатура, ПериодОтбора)
	Возврат РегистрыСведений.ЦеныНоменклатуры.ПолучитьАктуальнуюЦену(Номенклатура, ПериодОтбора);
КонецФункции

&НаКлиенте
Процедура РассчетСуммыТовара()
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Количество * СтрокаРасчета.Цена;
КонецПроцедуры
