# Область ОбработчикиСобытий
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)

	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчета.Цена = ПолучитьАктуальнуюЦену(СтрокаРасчета.Услуга, Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)

	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	
	Если СтрокаРасчета <> Неопределено Тогда
		СтрокаРасчета.Цена = ПолучитьАктуальнуюЦену(СтрокаРасчета.Товар, Объект.Дата);	
		РаботаСЦенамиКлиент.РассчетСуммыТовара(СтрокаРасчета);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	Если СтрокаРасчета <> Неопределено Тогда
		РаботаСЦенамиКлиент.РассчетСуммыТовара(СтрокаРасчета);
	КонецЕсли;
	
КонецПроцедуры

# КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьАктуальнуюЦену(Номенклатура, ПериодОтбора)

	Возврат РегистрыСведений.ЦеныНоменклатуры.ПолучитьАктуальнуюЦену(Номенклатура, ПериодОтбора);

КонецФункции

# КонецОбласти
