#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	
	СтрокаРасчета = Элементы.Материалы.ТекущиеДанные;
	Если СтрокаРасчета <> Неопределено Тогда
		РаботаСЦенамиКлиент.РассчетСуммыТовара(СтрокаРасчета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	
	СтрокаРасчета = Элементы.Материалы.ТекущиеДанные;
	Если СтрокаРасчета <> Неопределено Тогда
		РаботаСЦенамиКлиент.РассчетСуммыТовара(СтрокаРасчета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходныеМатериалы

&НаКлиенте
Процедура РасходникиЦенаПриИзменении(Элемент)
	
	СтрокаРасчета = Элементы.РасходныеМатериалы.ТекущиеДанные;
	Если СтрокаРасчета <> Неопределено Тогда
		РаботаСЦенамиКлиент.РассчетСуммыТовара(СтрокаРасчета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасходникиКоличествоПриИзменении(Элемент)
	
	СтрокаРасчета = Элементы.РасходныеМатериалы.ТекущиеДанные;
	Если СтрокаРасчета <> Неопределено Тогда
		РаботаСЦенамиКлиент.РассчетСуммыТовара(СтрокаРасчета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти