//// ДЗ №4
//НазваниеСклада = "Основной";
//КоличествоМеталла = 125;
//ДатаПодсчёта = "2022.04.01 10:00:00";
//
//Рез = СтрШаблон("На дату %1 остаток металла на складе «%2»: %3 шт.", ДатаПодсчёта, НазваниеСклада, КоличествоМеталла);
//
//Сообщить(Рез);
//
//СебестоимостьТовара = 100;
//ПроцентНаценки = "40%";
//СтавкаНДС = "20%";
//
//Наценка = СебестоимостьТовара * Лев(ПроцентНаценки, 2) / 100;
//ЦенаСНаценкой = СебестоимостьТовара + Наценка;
//НДС = ЦенаСНаценкой  * Лев(СтавкаНДС, 2) / 100;
//ИтоговаяЦена = ЦенаСНаценкой + НДС;
//
//Сообщить(ИтоговаяЦена);


//// ДЗ №5
//ДатаРождения = '1992.04.01 10:00:00';
//ВозрастВСекундах = ТекущаяДата() - ДатаРождения;
//ВозрастВНеделях = Цел(ВозрастВСекундах / 604800);
//Сообщить(ВозрастВНеделях);

//ПолнИмя = "Платформов Василий Михайлович";
//ИмяСокр = Сред(ПолнИмя, 12, 1);
//Фамилия = Лев(ПолнИмя, 10);
//ОтчествоСокр = Сред(ПолнИмя, 20, 1);
//ФИОСокр = СтрШаблон("%1 %2.%3.", Фамилия, ИмяСокр, ОтчествоСокр);
//Рез = ПолнИмя + " = " + ФИОСокр;
//Сообщить(Рез);


// ДЗ №6
ТекВремя = '2022.04.07 11:30:00';
ВремяВыкл = '2022.04.07 13:00:00';
Осталось_ВСекундах = ВремяВыкл - ТекВремя;
Осталось_Датой = '0001-01-01' + Осталось_ВСекундах;

Рез = СтрШаблон("До конца занятия: %1ч. %2мин.", Час(Осталось_Датой), Минута(Осталось_Датой));
Сообщить(Рез);