//// ДЗ №4
//НазваниеСклада = "Основной";
//КоличествоМеталла = 125;
//ДатаПодсчёта = "2022.04.01 10:00:00";
//
//Рез = СтрШаблон("На дату %1 остаток металла на складе «%2»: %3 шт.", ДатаПодсчёта, НазваниеСклада, КоличествоМеталла);
//
//Сообщить(Рез);
//
//СебестоимостьТовара = 100;
//ПроцентНаценки = "40%";
//СтавкаНДС = "20%";
//
//Наценка = СебестоимостьТовара * Лев(ПроцентНаценки, 2) / 100;
//ЦенаСНаценкой = СебестоимостьТовара + Наценка;
//НДС = ЦенаСНаценкой  * Лев(СтавкаНДС, 2) / 100;
//ИтоговаяЦена = ЦенаСНаценкой + НДС;
//
//Сообщить(ИтоговаяЦена);


//// ДЗ №5
//ДатаРождения = '1992.04.01 10:00:00';
//ВозрастВСекундах = ТекущаяДата() - ДатаРождения;
//ВозрастВНеделях = Цел(ВозрастВСекундах / 604800);
//Сообщить(ВозрастВНеделях);

//ПолнИмя = "Платформов Василий Михайлович";
//ИмяСокр = Сред(ПолнИмя, 12, 1);
//Фамилия = Лев(ПолнИмя, 10);
//ОтчествоСокр = Сред(ПолнИмя, 20, 1);
//ФИОСокр = СтрШаблон("%1 %2.%3.", Фамилия, ИмяСокр, ОтчествоСокр);
//Рез = ПолнИмя + " = " + ФИОСокр;
//Сообщить(Рез);


// ДЗ №6
//ТекВремя = '2022.04.07 11:30:00';
//ВремяВыкл = '2022.04.07 13:00:00';
//Осталось_ВСекундах = ВремяВыкл - ТекВремя;
//Осталось_Датой = '0001-01-01' + Осталось_ВСекундах;
//
//Рез = СтрШаблон("До конца занятия: %1ч. %2мин.", Час(Осталось_Датой), Минута(Осталось_Датой));
//Сообщить(Рез);


//// ДЗ №7 «Сколько времени?»
//ПредыдущаяНеделя = НеделяГода(ТекущаяДата()) - 1;
//
//ВсегоВыходных = 0;
//Пока ПредыдущаяНеделя > 1 Цикл
//	ПредыдущаяНеделя = ПредыдущаяНеделя - 1;
//	ВсегоВыходных = ВсегоВыходных + 2;
//КонецЦикла;
//
//// Сколько выходных на текущей неделе
//Если День(ТекущаяДата()) = 7 Тогда
//	ВсегоВыходных = ВсегоВыходных + 1;
//Иначе
//	ВсегоВыходных = ВсегоВыходных + 2;
//КонецЕсли;
//
//// Сколько выходных на первой неделе
//Если День(НачалоГода(ТекущаяДата())) = 7 Тогда
//	ВсегоВыходных = ВсегоВыходных + 1;
//Иначе
//	ВсегоВыходных = ВсегоВыходных + 2;
//КонецЕсли;
//
//Сообщить("С начала года прошло " + ВсегоВыходных + " выходных дня");

// ДЗ №7 «Угадай число»
//ЗагаданноеЧисло = 500;
//НазванноеЧисло = 513;
//
//НачалоДиапазона = ЗагаданноеЧисло - 10;
//КонецДиапазона = ЗагаданноеЧисло + 10;
//Рез = Ложь;
//
//Пока НачалоДиапазона <= КонецДиапазона Цикл
//	Если НачалоДиапазона = НазванноеЧисло Тогда
//		Рез = Истина;
//		Сообщить(НачалоДиапазона);
//	КонецЕсли;
//	НачалоДиапазона = НачалоДиапазона + 1;
//КонецЦикла;
//
//Если Рез = Истина Тогда
//	Сообщить("Угадано");
//Иначе
//	Сообщить("Не угадано");
//КонецЕсли;
//
//// ДЗ №7 «Здравствуйте, очень приятно»
//КолвоКлиентов = 0;
//Для ЧислоКлиентов = 1 по 10000 Цикл
//	КолвоКлиентов = КолвоКлиентов + 1;
//	Если ЧислоКлиентов = 100 Тогда
//		Сообщить("Вы сотый. Получаете возможность поселиться в номере ЛЮКС БЕСПЛАТНО!");
//	ИначеЕсли ЧислоКлиентов = 1000 Тогда
//		Сообщить("Вы тысячный. Получаете возможность поселиться в номере ЛЮКС БЕСПЛАТНО!");
//	ИначеЕсли ЧислоКлиентов = 10000 Тогда
//		Сообщить("Вы десятитысячный. Получаете возможность поселиться в номере ЛЮКС БЕСПЛАТНО!");
//	Иначе
////		Сообщить("Приветствую!");
//	КонецЕсли;
//КонецЦикла;
//Сообщить("Всего клиентов " + КолвоКлиентов);

// ДЗ №8
//#Область ОписаниеПеременных
//	Перем ИмяПользователя;	
//#КонецОбласти
//
//#Область ОбработчикиСобытий
	Процедура ПриНачалеРаботыСистемы()
//		СказатьПриветИПоздравить();
		ПроверкаДанныхОрганизацииАсинх();
	КонецПроцедуры

	Асинх Процедура ПроверкаДанныхОрганизацииАсинх()
		ДанныеЗаполнены = РаботаСКонстантамиВызовСервера.ДанныеОрганизацииЗаполнены();
		Если НЕ ДанныеЗаполнены Тогда
			Ждать ПредупреждениеАсинх("Заполните данные организации" ,5 ,"Данные не запонены");
			ОткрытьФорму("ОбщаяФорма.ДанныеОрганизации");
		КонецЕсли;
	КонецПроцедуры
//
//	АСИНХ Процедура СказатьПриветИПоздравить()
//		ИмяПользователя = Ждать ВвестиСтрокуАсинх("Иван", "Как вас зовут?");
//		Дата = ТекущаяДата();
//		ДР_Пользователя = Ждать ВвестиДатуАсинх(Дата, "Когда у вас день рождения?");
//		
//		Если (ДР_Пользователя = Дата) Тогда
//			ПредупреждениеАсинх("Привет, " + ИмяПользователя + "! Поздравляем!",, "Приветствие");
//		Иначе
//			БудетВБлижайшееВремя = Ложь;
//			БылВБлижайшееВремя = Ложь;
//			ВременнаяДата1 = КонецДня(ТекущаяДата());
//			ВременнаяДата2 = КонецДня(ТекущаяДата());
//			
//			//Проверяем будет/был ДР в течение 5 дней
//			Для КолвоДней = 1 по 5 Цикл
//		    	ВременнаяДата1 = ВременнаяДата1 + 60 * 60 * 24;
//		    	Если (КонецДня(ДР_Пользователя) = ВременнаяДата1) Тогда
//		    		БудетВБлижайшееВремя = Истина;
//		    	КонецЕсли;
//		    	Сообщить(ВременнаяДата2);
//		    	ВременнаяДата2 = ВременнаяДата2 - 60 * 60 * 24;
//		    	Если (КонецДня(ДР_Пользователя) = ВременнаяДата2) Тогда
//		    		БылВБлижайшееВремя = Истина;
//		    	КонецЕсли;
//			КонецЦикла;
//			
//			
//			Если (БудетВБлижайшееВремя) Тогда
//				ПредупреждениеАсинх("Привет, " + ИмяПользователя + "! Хорошего праздника!",, "Приветствие");
//			ИначеЕсли (БылВБлижайшееВремя) Тогда
//				ПредупреждениеАсинх("Привет, " + ИмяПользователя + "! Как прошел праздник?",, "Приветствие");
//			Иначе
//				ПредупреждениеАсинх("Здравствуйте, " + ИмяПользователя + "!",, "Приветствие");
//			КонецЕсли;
//		КонецЕсли;
//	КонецПроцедуры	
//#КонецОбласти      

//#Область Инициализации
//	ИмяПользователя = "Андрей";	
//#КонецОбласти











