НазваниеСклада = "Основной";
КоличествоМеталла = 125;
ДатаПодсчёта = "2022.04.01 10:00:00";

Рез = СтрШаблон("На дату %1 остаток металла на складе «%2»: %3 шт.", ДатаПодсчёта, НазваниеСклада, КоличествоМеталла);

Сообщить(Рез);

СебестоимостьТовара = 100;
ПроцентНаценки = "40%";
СтавкаНДС = "20%";

Наценка = СебестоимостьТовара * Лев(ПроцентНаценки, 2) / 100;
ЦенаСНаценкой = СебестоимостьТовара + Наценка;
НДС = ЦенаСНаценкой  * Лев(СтавкаНДС, 2) / 100;
ИтоговаяЦена = ЦенаСНаценкой + НДС;

Сообщить(ИтоговаяЦена);