#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	РасходнаяНакладная.НаменованиеПоставщика,
		|	РасходнаяНакладная.ИтоговаяСумма
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ИтоговаяСумма = Выборка.ИтоговаяСумма;
			Покупатель = Выборка.НаменованиеПоставщика;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.БухгалтерскиеПроводки.Записывать = Истина;
	Движение = Движения.БухгалтерскиеПроводки.Добавить();
	Движение.СчетДт = ПланыСчетов.ПланыСчетовБухгалтерии.Касса;
	Движение.СчетКт = ПланыСчетов.ПланыСчетовБухгалтерии.Покупатели;
	Движение.Период = Дата;
	Движение.Сумма = ИтоговаяСумма;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Покупатель] = Покупатель;

КонецПроцедуры

#КонецОбласти
