#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы из Материалы Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ТекСтрокаМатериалы.Материал;
		Движение.Количество = ТекСтрокаМатериалы.Количество;
	КонецЦикла;


	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаРасходныеМатериалы из РасходныеМатериалы Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ТекСтрокаРасходныеМатериалы.Расходник;
		Движение.Количество = ТекСтрокаРасходныеМатериалы.Количество;
	КонецЦикла;

КонецПроцедуры
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Запрос = Новый Запрос;

		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказПоставщику.НаменованиеПоставщика,
		|	ЗаказПоставщику.Договор,
		|	ЗаказПоставщику.ИтоговаяСумма,
		|	ЗаказПоставщику.Ссылка,
		|	ЗаказПоставщику.Материалы.(
		|		Ссылка,
		|		НомерСтроки,
		|		Материал,
		|		Количество,
		|		Цена,
		|		Сумма),
		|	ЗаказПоставщику.РасходныеМатериалы.(
		|		Ссылка,
		|		НомерСтроки,
		|		Расходник,
		|		Количество,
		|		Цена,
		|		Сумма)
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НаменованиеПоставщика = Выборка.НаменованиеПоставщика;
			Договор = Выборка.Договор;
			ИтоговаяСумма = Выборка.ИтоговаяСумма;
			Основание = Выборка.Ссылка;
			
			МатериалыВыборка = Выборка.Материалы.Выбрать();
	
			Пока МатериалыВыборка.Следующий() Цикл
				НоваяСтрока = Материалы.Добавить();
				НоваяСтрока.Материал = МатериалыВыборка.Материал;
				НоваяСтрока.Количество = МатериалыВыборка.Количество;
				НоваяСтрока.Цена = МатериалыВыборка.Цена;
				НоваяСтрока.Сумма = МатериалыВыборка.Сумма;
			КонецЦикла;
			
			РасходныеМатериалыВыборка = Выборка.РасходныеМатериалы.Выбрать();

			Пока РасходныеМатериалыВыборка.Следующий() Цикл
				НоваяСтрока = РасходныеМатериалы.Добавить();
				НоваяСтрока.Расходник = РасходныеМатериалыВыборка.Расходник;
				НоваяСтрока.Количество = РасходныеМатериалыВыборка.Количество;
				НоваяСтрока.Цена = РасходныеМатериалыВыборка.Цена;
				НоваяСтрока.Сумма = РасходныеМатериалыВыборка.Сумма;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
	     Возврат;
	КонецЕсли;
	ИтоговаяСумма = Материалы.Итог("Сумма") + РасходныеМатериалы.Итог("Сумма");

КонецПроцедуры

#КонецОбласти