#Область ОбработчикиСобытий

&НаКлиенте
Асинх Процедура ОбработкаКоманды(МассивСсылок, ПараметрыВыполненияКоманды)

	СписокВариантов = ПолучитьСписокВидовНоменклатуры();
	ВыбранныйВид = Ждать СписокВариантов.ВыбратьЭлементАсинх("Выберите вид номенклатуры");
	
	Если ВыбранныйВид <> Неопределено Тогда
		ИзменитьВидНоменклатуры(МассивСсылок, ВыбранныйВид.Значение);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокВидовНоменклатуры()
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.ВидНоменклатуры.Товар);  
	Список.Добавить(Перечисления.ВидНоменклатуры.Услуга);
	Список.Добавить(Перечисления.ВидНоменклатуры.РасходныйМатериал);  
	Список.Добавить(Перечисления.ВидНоменклатуры.Материал);
	Возврат Список;
КонецФункции

&НаСервере
Процедура ИзменитьВидНоменклатуры(МассивСсылок, ВыбранныйВид)
	Для каждого НоменклатураСсылка из МассивСсылок Цикл
		НоменклатураОбъект = НоменклатураСсылка.ПолучитьОбъект();
		НоменклатураОбъект.ВидНоменклатуры = ВыбранныйВид;
		НоменклатураОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти