#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
	     Возврат;
	КонецЕсли;

	Для Каждого СтрокаСотрудника из СписокСотрудников Цикл
		СтрокаСотрудника.Ставка = РегистрыСведений.СтавкиСотрудников.ПолучитьСтавку(СтрокаСотрудника.Сотрудник, Дата);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Зарплата.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВидыРасчетов.Ставка;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Ставка = ТекСтрокаСписокСотрудников.Ставка;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
    Движения.Зарплата.Рассчитать();

КонецПроцедуры



#КонецОбласти