#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для Каждого СтрокаСотрудника из ЭтотОбъект.СписокСотрудников Цикл
		СтрокаСотрудника.Ставка = РегистрыСведений.СтавкиСотрудников.ПолучитьСтавку(СтрокаСотрудника.Сотрудник, ЭтотОбъект.Дата);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр Зарплата
	Движения.Зарплата.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников из СписокСотрудников Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВидыРасчетов.Ставка;
		Движение.ПериодРегистрации = ЭтотОбъект.Дата;
		Движение.ПериодДействияНачало = НачалоМесяца(ЭтотОбъект.Дата);
		Движение.ПериодДействияКонец = КонецМесяца(ЭтотОбъект.Дата);
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Ставка = ТекСтрокаСписокСотрудников.Ставка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти