#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		Запрос = Новый Запрос;

		Запрос.Текст = "ВЫБРАТЬ
		|	РасходнаяНакладная.Договор,
		|	РасходнаяНакладная.ИтоговаяСумма,
		|	РасходнаяНакладная.НаменованиеПоставщика,
		|	РасходнаяНакладная.Ссылка
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	РасходнаяНакладная.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НаменованиеПоставщика = Выборка.НаменованиеПоставщика;
			Договор = Выборка.Договор;
			ИтоговаяСумма = Выборка.ИтоговаяСумма;
			Основание = Выборка.Ссылка;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти