#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаРасходныеМатериалы из РасходныеМатериалы Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаРасходныеМатериалы.Материал;
		Движение.Количество = ТекСтрокаРасходныеМатериалы.Количество;
	КонецЦикла;
	
	Движения.ОстаткиНоменклатуры.Записать();
	Отказ = РегистрыНакопления.ОстаткиНоменклатуры.ЕстьОтрицательныеОстаткиМатериал(Ссылка, Дата);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Запрос = Новый Запрос;

		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказПоставщику.НаменованиеПоставщика,
		|	ЗаказПоставщику.Договор,
		|	ЗаказПоставщику.ИтоговаяСумма,
		|	ЗаказПоставщику.Ссылка,
		|	ЗаказПоставщику.Материалы.(
		|		Ссылка,
		|		НомерСтроки,
		|		Материал,
		|		Количество),
		|	ЗаказПоставщику.РасходныеМатериалы.(
		|		Ссылка,
		|		НомерСтроки,
		|		Расходник,
		|		Количество)
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();

		Пока Выборка.Следующий() Цикл
			НаменованиеПоставщика = Выборка.НаменованиеПоставщика;
			Договор = Выборка.Договор;
			ИтоговаяСумма = Выборка.ИтоговаяСумма;
			Основание = Выборка.Ссылка;
			
			МатериалыВыборка = Выборка.Материалы.Выбрать();
	
			Пока МатериалыВыборка.Следующий() Цикл
				НоваяСтрока = Материалы.Добавить();
				НоваяСтрока.Материал = МатериалыВыборка.Материал;
				НоваяСтрока.Количество = МатериалыВыборка.Количество;
			КонецЦикла;
			
			РасходныеМатериалыВыборка = Выборка.РасходныеМатериалы.Выбрать();

			Пока РасходныеМатериалыВыборка.Следующий() Цикл
				НоваяСтрока = РасходныеМатериалы.Добавить();
				НоваяСтрока.Материал = РасходныеМатериалыВыборка.Расходник;
				НоваяСтрока.Количество = РасходныеМатериалыВыборка.Количество;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти