Функция ПолучитьСтавку(СотрудникОтбора, ПериодОтбора) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиСотрудниковСрезПоследних.Ставка КАК Ставка
		|ИЗ
		|	РегистрСведений.СтавкиСотрудников.СрезПоследних(&ПериодСреза, Сотрудник = &СотрудникОтбора) КАК СтавкиСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ПериодСреза", ПериодОтбора);
	Запрос.УстановитьПараметр("СотрудникОтбора", СотрудникОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		СтавкаСотрудника = 0;	
	Иначе
	   	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
       	ВыборкаДетальныеЗаписи.Следующий();
		
	  	СтавкаСотрудника = ВыборкаДетальныеЗаписи.Ставка;
	КонецЕсли;
	
	Возврат СтавкаСотрудника;
КонецФункции