Функция ЕстьОтрицательныеОстаткиРасходая(СсылкаНаРН, ДатаОтбора) Экспорт 

	ГраницаОтбора = Новый Граница(ДатаОтбора,ВидГраницы.Включая);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&ДатаОтбора,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					РасходнаяНакладнаяТовары.Товар КАК Товар
		|				ИЗ
		|					Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|				ГДЕ
		|					РасходнаяНакладнаяТовары.Ссылка = &СсылкаРН)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОтбора", ГраницаОтбора);
	Запрос.УстановитьПараметр("СсылкаРН", СсылкаНаРН);
	
	РезультатЗапроса = Запрос.Выполнить();  
		
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		СтрокаВыводы = СтрШаблон(НСтр("ru='Не хватает товара ""%1"" в количестве %2.'"), ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.КоличествоОстаток);
		Сообщить(СтрокаВыводы);		
	КонецЦикла;  
	
	Возврат Истина;

КонецФункции

Функция ЕстьОтрицательныеОстаткиМатериал(СсылкаНаПП, ДатаОтбора) Экспорт 

	ГраницаОтбора = Новый Граница(ДатаОтбора, ВидГраницы.Включая);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&ДатаОтбора,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					ПроизводствоПродукцииМатериалы.Материал КАК Материал
		|				ИЗ
		|					Документ.ПроизводствоПродукции.Материалы КАК ПроизводствоПродукцииМатериалы
		|				ГДЕ
		|					ПроизводствоПродукцииМатериалы.Ссылка = &СсылкаПП)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОтбора", ГраницаОтбора);
	Запрос.УстановитьПараметр("СсылкаПП", СсылкаНаПП);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаВыводы = СтрШаблон(НСтр("ru='Не хватает материала ""%1"" в количестве %2.'"), ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.КоличествоОстаток);
				
	КонецЦикла;  
	
	Возврат Истина;

КонецФункции