#Область ОбработчикиСобытий
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Родитель");
	Поля.Добавить("ЭтоГруппа");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Перем НаименованиеРодителя;
	СтандартнаяОбработка = ложь;
	//проверяем на пустую ссылку
	Если ЗначениеЗаполнено(Данные.Родитель) Тогда
		НовыйЗапрос=Новый Запрос();
		НовыйЗапрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.Родитель
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование = &Наименование";
		НовыйЗапрос.УстановитьПараметр("Наименование", Данные.Наименование);
		Результат = НовыйЗапрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий()Цикл
			НаименованиеРодителя = Результат.Родитель.Наименование;
		КонецЦикла;
		ф=1;
		Представление = СтрШаблон(НСтр("ru='%1 (%2)'"), Данные.Наименование, НаименованиеРодителя);
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти