#Область ПрограммныйИнтерфейс

АСИНХ Функция ПолучитьИмяЗагружаемогоФайлаАсинх() Экспорт
		
	Файл = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Файл.ПроверятьСуществованиеФайла = Истина;
	
	РезультатВыбораФайла = ЖДАТЬ Файл.ВыбратьАсинх();  
	
	Если РезультатВыбораФайла = Неопределено Тогда
		Результат = "";
	Иначе	
		Результат = РезультатВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции  

АСИНХ Функция ПолучитьИмяСохраняемогоФайлаАсинх() Экспорт

	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Результат = ЖДАТЬ Проводник.ВыбратьАсинх();  
	
	Если Результат = Неопределено Тогда
		Возврат "";
	Иначе	
		Возврат Проводник.ПолноеИмяФайла;
	КонецЕсли;

КонецФункции

АСИНХ Функция ПолучитьОписаниеФайлаАсинх(ПутьКФайлу) Экспорт

	Файл = Новый Файл(ПутьКФайлу);
	ОписаниеФайла = Новый Структура("Размер, Расширение"); 
	
	Если ЖДАТЬ Файл.СуществуетАсинх() Тогда		
		ОписаниеФайла.Размер = ЖДАТЬ Файл.РазмерАсинх();
		ОписаниеФайла.Расширение = Файл.Расширение;
	Иначе		
		СтрокаВывода = СтрШаблон(НСтр("ru='Файла ""%1"" не существует!'"), ПутьКФайлу);
		ВзаимодействиеСПользоватемКлиент.СообщитьПользователю(СтрокаВывода);			
	КонецЕсли;
	
	Возврат ОписаниеФайла; 
	
КонецФункции

#КонецОбласти