
&НаКлиенте
Процедура ПоказатьРезультат(Команда)
	ТекущаяСтраница = ЭтаФорма.Элементы.Алгоритмы.ТекущаяСтраница.Имя;
	Сообщить(ТекущаяСтраница);
	Если ТекущаяСтраница <> Неопределено ИЛИ ТекущаяСтраница = "ДЗ_2" Тогда
		СортировкаФамилий();
	ИначеЕсли ТекущаяСтраница = "ДЗ_3" Тогда 
		ПоказатьПользователей();
		СформироватьТаблицуЗначений();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ТекущаяСтраница = ЭтаФорма.Элементы.Алгоритмы.ТекущаяСтраница.Имя;
	Если ТекущаяСтраница <> Неопределено Тогда Сообщить("!")
	КонецЕсли;
КонецПроцедуры

Процедура СортировкаФамилий()
	Фамилии = Новый Массив;
	Фамилии.Добавить("Иванов");
	Фамилии.Добавить("Арбузов");
	Фамилии.Добавить("Платформов");
	Фамилии.Добавить("Физиков");
	Фамилии.Добавить("Юриков");
	Фамилии.Добавить("Бобров");
	Фамилии.Добавить("Федотов");
	
	МаксИндекс = Фамилии.ВГраница();

	Для Индекс = 0 по МаксИндекс Цикл
		Для Индекс1 = 0 по МаксИндекс Цикл
			Если Фамилии[Индекс1] > Фамилии[Индекс] Тогда
				ФамилияВрем = Фамилии[Индекс];
				Фамилии[Индекс] = Фамилии[Индекс1];
				Фамилии[Индекс1] = ФамилияВрем;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Но, по-моему, лучше так
//	СписокЗначений = Новый СписокЗначений; 
//    СписокЗначений.ЗагрузитьЗначения(Фамилии);
//    СписокЗначений.СортироватьПоЗначению();
//    Фамилии = СписокЗначений.ВыгрузитьЗначения();

	Для Каждого Фамилия из Фамилии Цикл
		Сообщить(Фамилия);
	КонецЦикла;
КонецПроцедуры

Процедура ПоказатьПользователей()
	Пользователи = Новый Массив();
	
	Пользователь = Новый Структура();
	Пользователь.Вставить("Фамилия", "Иванов");
	Пользователь.Вставить("Имя", "Иван");
	Пользователь.Вставить("Отчество", "Иванович");
	Пользователь.Вставить("Возраст", "25");
	
	Пользователи.Добавить(Пользователь);

	Для Каждого Пользователь из Пользователи Цикл
		Стр = СтрШаблон(НСтр("ru='%1 %2.%3. - %4 лет'"),
			Пользователь.Фамилия, Лев(Пользователь.Имя, 1), Лев(Пользователь.Отчество, 1), Пользователь.Возраст);
		Сообщить(Стр);
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьТаблицуЗначений()
	Товары = Новый ТаблицаЗначений();
	Товары.Колонки.Добавить("Товар");
	Товары.Колонки.Добавить("Остаток");
	
	НоваяСтрока = Товары.Добавить();
	НоваяСтрока.Товар = "Яблоки";
	НоваяСтрока.Остаток = 10;
	
	НоваяСтрока1 = Товары.Добавить();
	НоваяСтрока1.Товар = "Яблоки";
	НоваяСтрока1.Остаток = 20;
	
	НоваяСтрока2 = Товары.Добавить();
	НоваяСтрока2.Товар = "Груши";
	НоваяСтрока2.Остаток = 5;
	
	Товары.Свернуть("Товар", "Остаток");

	Для Каждого Товар из Товары Цикл
		Стр = СтрШаблон(НСтр("ru='%1 %2'"), Товар.Товар, Товар.Остаток);
		Сообщить(Стр);
	КонецЦикла;
КонецПроцедуры
