#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьРезультат(Команда)

	ТекущаяСтраница = ЭтаФорма.Элементы.Алгоритмы.ТекущаяСтраница.Имя;	
	Если ТекущаяСтраница = Неопределено ИЛИ ТекущаяСтраница = "ДанныеОрганизации" Тогда
		ПроверкаДанныхОрганизацииАсинх();
	ИначеЕсли ТекущаяСтраница = "СортировкаФамилий" Тогда
		СортировкаФамилий();
	ИначеЕсли ТекущаяСтраница = "СообщениеПользователю" Тогда
		СообщитьПользователю();
	ИначеЕсли ТекущаяСтраница = "РасчетИтоговойЦены" Тогда
		РасчетИтоговойЦены();
	ИначеЕсли ТекущаяСтраница = "СколькоВамНедель" Тогда
		СколькоВамНедель();
	ИначеЕсли ТекущаяСтраница = "ВашаФамилия" Тогда
		ВашаФамилия();
	ИначеЕсли ТекущаяСтраница = "СколькоОсталосьВремени" Тогда
		СколькоОсталосьВремени();
	ИначеЕсли ТекущаяСтраница = "СколькоВыходных" Тогда
		СколькоВыходных();
	ИначеЕсли ТекущаяСтраница = "УгадайЧисло" Тогда
		УгадайЧисло();
	ИначеЕсли ТекущаяСтраница = "Здравствуйте" Тогда
		Приветствие();
	ИначеЕсли ТекущаяСтраница = "КакТебяЗовут" Тогда
		СказатьПриветИПоздравить();
	ИначеЕсли ТекущаяСтраница = "Структура" Тогда 
		ПоказатьПользователей();
	ИначеЕсли ТекущаяСтраница = "ТаблицаЗначений" Тогда 
		СформироватьТаблицуЗначений();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
АСИНХ Процедура СказатьПриветИПоздравить()

	ИмяПользователя = Ждать ВвестиСтрокуАсинх("Иван", "Как вас зовут?");
	Дата = ТекущаяДата();
	ДР_Пользователя = Ждать ВвестиДатуАсинх(Дата, "Когда у вас день рождения?");
		
	Если (День(ДР_Пользователя) = День(Дата) И Месяц(ДР_Пользователя) = Месяц(Дата)) Тогда
		ПредупреждениеАсинх("Привет, " + ИмяПользователя + "! Поздравляем!",, "Приветствие");
	Иначе
		БудетВБлижайшееВремя = Ложь;
		БылВБлижайшееВремя = Ложь;
		ВременнаяДата1 = КонецДня(ТекущаяДата());
		ВременнаяДата2 = КонецДня(ТекущаяДата());
			
		//Проверяем будет/был ДР в течение 5 дней
		Для КолвоДней = 1 по 5 Цикл
		    ВременнаяДата1 = ВременнаяДата1 + 60 * 60 * 24;
		    Если (День(ДР_Пользователя) = День(ВременнаяДата1) И Месяц(ДР_Пользователя) = Месяц(ВременнаяДата1)) Тогда
		    	БудетВБлижайшееВремя = Истина;
		    КонецЕсли;
		    ВременнаяДата2 = ВременнаяДата2 - 60 * 60 * 24;
		    Если (День(ДР_Пользователя) = День(ВременнаяДата2) И Месяц(ДР_Пользователя) = Месяц(ВременнаяДата2)) Тогда
		    	БылВБлижайшееВремя = Истина;
		    КонецЕсли;
		КонецЦикла;
			
			
		Если (БудетВБлижайшееВремя) Тогда
			ПредупреждениеАсинх("Привет, " + ИмяПользователя + "! Хорошего праздника!",, "Приветствие");
		ИначеЕсли (БылВБлижайшееВремя) Тогда
			ПредупреждениеАсинх("Привет, " + ИмяПользователя + "! Как прошел праздник?",, "Приветствие");
		Иначе
			ПредупреждениеАсинх("Здравствуйте, " + ИмяПользователя + "!",, "Приветствие");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура Приветствие()

	КолвоКлиентов = 0;
	Для ЧислоКлиентов = 1 по 10000 Цикл
		КолвоКлиентов = КолвоКлиентов + 1;
		Если ЧислоКлиентов = 100 Тогда
			ВзаимодействиеСПользоватемКлиент.СообщитьПользователю("Вы сотый. Получаете возможность поселиться в номере ЛЮКС БЕСПЛАТНО!");
		ИначеЕсли ЧислоКлиентов = 1000 Тогда
			ВзаимодействиеСПользоватемКлиент.СообщитьПользователю("Вы тысячный. Получаете возможность поселиться в номере ЛЮКС БЕСПЛАТНО!");
		ИначеЕсли ЧислоКлиентов = 10000 Тогда
			ВзаимодействиеСПользоватемКлиент.СообщитьПользователю("Вы десятитысячный. Получаете возможность поселиться в номере ЛЮКС БЕСПЛАТНО!");
		КонецЕсли;
	КонецЦикла;
	ВзаимодействиеСПользоватемКлиент.СообщитьПользователю("Всего клиентов " + КолвоКлиентов);

КонецПроцедуры

&НаКлиенте
Процедура УгадайЧисло()

	НачалоДиапазона = ЗагаданноеЧисло - 10;
	КонецДиапазона = ЗагаданноеЧисло + 10;
	Рез = Ложь;
	
	Пока НачалоДиапазона <= КонецДиапазона Цикл
		Если НачалоДиапазона = НазванноеЧисло Тогда
			Рез = Истина;
		КонецЕсли;
		НачалоДиапазона = НачалоДиапазона + 1;
	КонецЦикла;
	
	Если Рез = Истина Тогда
		ВзаимодействиеСПользоватемКлиент.СообщитьПользователю("Угадано");
	Иначе
		ВзаимодействиеСПользоватемКлиент.СообщитьПользователю("Не угадано");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СколькоВыходных()

	ПредыдущаяНеделя = НеделяГода(ТекущаяДата()) - 1;

	ВсегоВыходных = 0;
	Пока ПредыдущаяНеделя > 1 Цикл
		ПредыдущаяНеделя = ПредыдущаяНеделя - 1;
		ВсегоВыходных = ВсегоВыходных + 2;
	КонецЦикла;
	
	// Сколько выходных на текущей неделе
	Если День(ТекущаяДата()) = 7 Тогда
		ВсегоВыходных = ВсегоВыходных + 1;
	Иначе
		ВсегоВыходных = ВсегоВыходных + 2;
	КонецЕсли;
	
	// Сколько выходных на первой неделе
	Если День(НачалоГода(ТекущаяДата())) = 7 Тогда
		ВсегоВыходных = ВсегоВыходных + 1;
	Иначе
		ВсегоВыходных = ВсегоВыходных + 2;
	КонецЕсли;
	
	ВзаимодействиеСПользоватемКлиент.СообщитьПользователю("С начала года прошло " + ВсегоВыходных + " выходных дня");

КонецПроцедуры

&НаКлиенте
Процедура СколькоОсталосьВремени()

	Осталось_ВСекундах = ВремяВыкл - ТекВремя;
	Осталось_Датой = '0001-01-01' + Осталось_ВСекундах;
	
	Рез = СтрШаблон(НСтр("ru='До конца занятия: %1ч. %2мин.'"), Час(Осталось_Датой), Минута(Осталось_Датой));
	ВзаимодействиеСПользоватемКлиент.СообщитьПользователю(Рез);

КонецПроцедуры

&НаКлиенте
Процедура ВашаФамилия()

	ПолнИмя = "Платформов Василий Михайлович";
	ИмяСокр = Сред(ПолнИмя, 12, 1);
	Фамилия = Лев(ПолнИмя, 10);
	ОтчествоСокр = Сред(ПолнИмя, 20, 1);
	ФИОСокр = СтрШаблон(НСтр("ru='%1 %2.%3.'"), Фамилия, ИмяСокр, ОтчествоСокр);
	Рез = ПолнИмя + " = " + ФИОСокр;
	ВзаимодействиеСПользоватемКлиент.СообщитьПользователю(Рез);

КонецПроцедуры

&НаКлиенте
Процедура СколькоВамНедель()

	ВозрастВСекундах = ТекущаяДата() - ДатаРождения;
	ВозрастВНеделях = Цел(ВозрастВСекундах / 604800);
	ВзаимодействиеСПользоватемКлиент.СообщитьПользователю(ВозрастВНеделях);

КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователю()

	Рез = СтрШаблон(НСтр("ru='На дату %1 остаток металла на складе «%2»: %3 шт.'"), ДатаПодсчёта, НазваниеСклада, КоличествоМеталла);
	ВзаимодействиеСПользоватемКлиент.СообщитьПользователю(Рез);

КонецПроцедуры

&НаКлиенте
Процедура РасчетИтоговойЦены()

	Наценка = СебестоимостьТовара * ПроцентНаценки / 100;
	ЦенаСНаценкой = СебестоимостьТовара + Наценка;
	НДС = ЦенаСНаценкой  * СтавкаНДС / 100;
	ИтоговаяЦена = Окр(ЦенаСНаценкой + НДС, 2);
	
	ВзаимодействиеСПользоватемКлиент.СообщитьПользователю(ИтоговаяЦена);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПроверкаДанныхОрганизацииАсинх()

	ДанныеЗаполнены = РаботаСКонстантамиВызовСервера.ДанныеОрганизацииЗаполнены();
	Если НЕ ДанныеЗаполнены Тогда
		Ждать ПредупреждениеАсинх("Заполните данные организации" ,5 ,"Данные не запонены");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СортировкаФамилий()

	Фамилии = Новый Массив;
	
	Для Индекс = 0 по 6 Цикл
    	Фамилии.Добавить(ЭтотОбъект["Элемент" + Индекс]);
    КонецЦикла; 

	Для Индекс = 0 по 6 Цикл
		Для Индекс1 = 0 по 6 Цикл
			Если Фамилии[Индекс1] > Фамилии[Индекс] Тогда
				ФамилияВрем = Фамилии[Индекс];
				Фамилии[Индекс] = Фамилии[Индекс1];
				Фамилии[Индекс1] = ФамилияВрем;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	// Но, по-моему, лучше так
//	СписокЗначений = Новый СписокЗначений; 
//    СписокЗначений.ЗагрузитьЗначения(Фамилии);
//    СписокЗначений.СортироватьПоЗначению();
//    Фамилии = СписокЗначений.ВыгрузитьЗначения();

	Для Индекс = 0 по 6 Цикл
    	ЭтотОбъект["Результат" + Индекс] = Фамилии[Индекс];
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПользователей()

	Пользователи = Новый Массив();
	
	Пользователь = Новый Структура();
	Пользователь.Вставить("Фамилия", Фамилия);
	Пользователь.Вставить("Имя", Имя);
	Пользователь.Вставить("Отчество", Отчество);
	Пользователь.Вставить("Возраст", Возраст);
	
	Пользователи.Добавить(Пользователь);

	Для Каждого Пользователь из Пользователи Цикл
		Стр = СтрШаблон(НСтр("ru='%1 %2.%3. - %4 лет'"),
			Пользователь.Фамилия, Лев(Пользователь.Имя, 1), Лев(Пользователь.Отчество, 1), Пользователь.Возраст);
		ВзаимодействиеСПользоватемКлиент.СообщитьПользователю(Стр);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуЗначений()

	Товары = Новый ТаблицаЗначений();
	Товары.Колонки.Добавить("Товар");
	Товары.Колонки.Добавить("Остаток");
	
	НоваяСтрока = Товары.Добавить();
	НоваяСтрока.Товар = "Яблоки";
	НоваяСтрока.Остаток = 10;
	
	НоваяСтрока1 = Товары.Добавить();
	НоваяСтрока1.Товар = "Яблоки";
	НоваяСтрока1.Остаток = 20;
	
	НоваяСтрока2 = Товары.Добавить();
	НоваяСтрока2.Товар = "Груши";
	НоваяСтрока2.Остаток = 5;
	
	Товары.Свернуть("Товар", "Остаток");

	Для Каждого Товар из Товары Цикл
		Стр = СтрШаблон(НСтр("ru='%1 %2'"), Товар.Товар, Товар.Остаток);
		Сообщить(Стр);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти