#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	РассчетСуммыМатериалы();	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	РассчетСуммыМатериалы();
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходныеМатериалы

&НаКлиенте
Процедура РасходникиЦенаПриИзменении(Элемент)
	РассчетСуммыРасходники();	
КонецПроцедуры

&НаКлиенте
Процедура РасходникиКоличествоПриИзменении(Элемент)
	РассчетСуммыРасходники();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РассчетСуммыМатериалы()
	СтрокаРасчета = Элементы.Материалы.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Количество * СтрокаРасчета.Цена;
КонецПроцедуры

&НаКлиенте
Процедура РассчетСуммыРасходники()
	СтрокаРасчета = Элементы.РасходныеМатериалы.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Количество * СтрокаРасчета.Цена;
КонецПроцедуры

#КонецОбласти