Процедура Рассчитать() Экспорт
	Для Каждого СтрокаДвижения из ЭтотОбъект Цикл
		НормаЧасов = СтрокаДвижения.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия).Итог("КоличествоЧасов");
		ФактЧасов = СтрокаДвижения.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия).Итог("КоличествоЧасов");
		ллл = СтрокаДвижения.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия);
		Если НормаЧасов = 0 Тогда
			Сообщить(НормаЧасов);
			Сообщить(ФактЧасов);
			ВызватьИсключение "";
		КонецЕсли;

	    СтрокаДвижения.Сумма = СтрокаДвижения.Оклад * (ФактЧасов / НормаЧасов);
	КонецЦикла;

КонецПроцедуры