 #Область ОбработчикиСобытийЭлементовФормы
 
 &НаКлиенте
 Процедура АдресКартинкиВХранилищеНажатие(Элемент, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
	 ПрикрепитьФайлКартинкиАсинх();	 
 КонецПроцедуры  
 
 &НаСервере
 Процедура ПриЧтенииНаСервере(ТекущийОбъект)	 
	 ДанныеКартинки = РегистрыСведений.Файлы.ПолучитьДанныеФайла(ТекущийОбъект.Ссылка);
	 
	 Если ДанныеКартинки <> Неопределено Тогда		
		 ЭтотОбъект.АдресКартинкиВХранилище = ПоместитьВоВременноеХранилище(ДанныеКартинки, ЭтотОбъект.УникальныйИдентификатор);	
	 КонецЕсли;	 
 КонецПроцедуры
 #КонецОбласти
 
 #Область ОбработчикиСобытийФормы 
 &НаСервере
 Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	 
	 Если ЭтоАдресВременногоХранилища(ЭтотОбъект.АдресКартинкиВХранилище) Тогда		 
		 ДанныеКартинки = ПолучитьИзВременногоХранилища(ЭтотОбъект.АдресКартинкиВХранилище);
		 
		 Если ДанныеКартинки = Неопределено Тогда		
			 Сообщить("При сохранении изображения произошла ошибка...");		
		 Иначе		
			 РегистрыСведений.Файлы.ЗаписатьФайлВБазу(ТекущийОбъект.Ссылка, ДанныеКартинки, ЭтотОбъект.РасширениеФайлаКартинки, ЭтотОбъект.РазмерФайлаКартинки);		
		 КонецЕсли;		 
	 КонецЕсли;
 КонецПроцедуры 
 #КонецОбласти 
 
 
 #Область СлужебныеПроцедурыИФункции 
 &НаКлиенте
 АСИНХ Процедура ПрикрепитьФайлКартинкиАсинх()	 
	 ИмяФайлаКартинки = ЖДАТЬ РаботаСФайламиКлиент.ПолучитьИмяЗагружаемогоФайлаАсинх();
	 
	 Если ПустаяСтрока(ИмяФайлаКартинки) = Ложь Тогда
		 ОписаниеФайла = ЖДАТЬ РаботаСФайламиКлиент.ПолучитьОписаниеФайлаАсинх(ИмяФайлаКартинки);
		 
		 ЭтотОбъект.РасширениеФайлаКартинки = ОписаниеФайла.Расширение;
		 ЭтотОбъект.РазмерФайлаКартинки	= ОписаниеФайла.Размер; 
		 
		 ОписаниеПомещаемогоФайла = ЖДАТЬ ПоместитьФайлНаСерверАсинх(,,, ИмяФайлаКартинки, ЭтотОбъект.УникальныйИдентификатор);
		 ЭтотОбъект.АдресКартинкиВХранилище = ОписаниеПомещаемогоФайла.Адрес;		 
	 КонецЕсли;	 
 КонецПроцедуры
 #КонецОбласти
